num = int(input("Введите пятизначное число: "))  # 97531, например
# print("Исходное число:", num)
a = num % 10  # * 10000
print("a =", a, "# Цифра пятого знака, единицы")
num //= 10  # Целочисленное деление
# print("После целочисленного деления № 1:", num)
b = num % 10  # * 1000
print("b =", b, "# Цифра четвёртого знака, десятки")
num //= 10
# print("После целочисленного деления № 2:", num)
c = num % 10  # * 100
print("c =", c, "# Цифра третьего знака, сотни")
num //= 10
# print("После целочисленного деления № 3:", num)
d = num % 10  # * 10
print("d =", d, "# Цифра второго знака, тысячные")
num //= 10
# print("После целочисленного деления № 4:", num)
i = num % 10
print("i =", i, "# Цифра первого знака, десятитысячные")
prod = a * b * c * d * i
aver = (a + b + c + d + i) / 5
print(
    "Произведение цифр ведённого числа составит:\t", prod,
    "\n\t\t\t\t\tСреднее арифметическое:\t", aver
)

# a = num % 10
# print("a:", a)
# num = num // 10
# print("num:", num)
# b = num % 10
# print("b:", b)
# num = num // 10
# print("num:", num)
# c = num % 10
# print("c:", c)
# num = num // 10
# print("num:", num)
# d = num % 10
# print("d:", d)
# print("Обратное число:", a * 1000 + b * 100 + c * 10 + d)
