import re

# d = "05-03-1987  # Дата рождения"
#
# print("Дата рождения:", re.sub(r"\s\s#.+", "", d))
#
# print(re.sub("-", ".", d))
#
# print("Дата рождения:", re.sub(r"\s\s#.+", "", re.sub("-", ".", d)))

"""Попросите пользователя ввести текущую дату по заданному шаблону 
и проверьте данные на соответствие"""
# Введите дату в формате dd-mm-YYYY: 28-08-2021

# st = input("Введите дату в формате dd-mm-YYYY: ")
st = "31-12-2089"
reg = r"^([0-2][0-9]|3[0-1])-(0[0-9]|1[0-2])-(19[0-9][0-9]|20[0-9][0-9])$"
print(re.findall(reg, st))

# # reg = r"\d{4}"

reg1 = r"^([0-2][0-9]|3[0-1])-(0[0-9]|1[0-2])-(19[0-9][0-9]|20[0-9][0-9]|2100)$"
print(re.findall(reg1, st))