import json

"""Уровень 1: Базовый

#Задача: напишите функцию calculate_area, которая вычисляет площадь прямоугольника. Функция должна принимать длину
 и ширину, а затем возвращать площадь. Основная программа должна запрашивать у пользователя длину и ширину,
  а затем выводить результат, используя эту функцию."""

# def calculate_area(l, w):
#     s = l * w
#     return s
#
#
# len_ = float(input("Введите длину прямоугольника: "))
# wet_ = float(input("Введите ширину прямоугольника: "))
# rez_S = calculate_area(len_, wet_)
#
# print("Площадь прямоугольника, составляет S =", round(rez_S, 3))


"""Уровень 2: Средний

#Задача: создайте модуль string_utils.py, который содержит функции для работы со строками:
reverse_string(text) — возвращает перевёрнутую строку. count_vowels(text) — возвращает количество гласных букв в строке. is_palindrome(text) — проверяет, является ли строка палиндромом (читается одинаково в обоих направлениях). Напишите основную программу, которая импортирует этот модуль и предоставляет пользователю выбор функции для работы со строкой."""


